export/Containers_own_psi_system.puml
@startuml
set separator none
title PSI System - Containers

top to bottom direction

!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4.puml
!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Context.puml
!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Container.puml

System(BroadcasterCustomerAppliance, "Broadcaster Customer Appliance", "Broadcaster's streaming appliance, content-management-system (may be a streaming platform, may be an editorial system or any other system targeted towards customers)", $tags="")
Person(User, "User", "A user is a broadcaster's recipient, using the services the broadcaster supplies", $tags="")
System(OtherPSISystem, "Other PSI System", "Broadcaster's streaming appliance, content-management-system (may be a streaming platform, may be an editorial system or any other system targeted towards customers)", $tags="")

System_Boundary("PSISystem_boundary", "PSI System", $tags="") {
  Boundary(group_0, "PSI Frontend") {
    ContainerDb(PSISystem.PSIcommentapidatabasesearchindex, "PSI comment api database\n (search index)", "", $tags="")
    Container(PSISystem.PSIfrontendmodule, "PSI frontend module", "This represents all frontend modules of this PSI-instance.", $tags="")
    Container(PSISystem.PSIfrontendAPI, "PSI frontend API", "This represents all api-services of this PSI-instance.", $tags="")
    ContainerDb(PSISystem.PSIapidatabase, "PSI api database", "", $tags="")
    Container(PSISystem.PSIcommentexportAPI, "PSI comment export API", "This represents the export api of this PSI-instance.", $tags="")
  }

}

Rel_D(PSISystem.PSIcommentexportAPI, PSISystem.PSIcommentapidatabasesearchindex, "reads from and writes to", $tags="")
Rel_D(User, BroadcasterCustomerAppliance, "", $tags="")
Rel_D(User, PSISystem.PSIfrontendmodule, "direct interaction with a fused frontend (social network) or a catalogue of apps", $tags="")
Rel_D(BroadcasterCustomerAppliance, PSISystem.PSIfrontendmodule, "embeds PSI-frontend modules(native or via iframe)", $tags="")
Rel_D(BroadcasterCustomerAppliance, PSISystem.PSIfrontendAPI, "authenticates at PSI-related  backends of its own PSI-cluster", $tags="")
Rel_D(OtherPSISystem, PSISystem.PSIcommentexportAPI, "", $tags="")
Rel_D(PSISystem.PSIcommentexportAPI, OtherPSISystem, "comment and account exchange", $tags="")
Rel_D(PSISystem.PSIfrontendmodule, PSISystem.PSIfrontendAPI, "submits and gathers data stored by the backend", $tags="")
Rel_D(PSISystem.PSIfrontendAPI, PSISystem.PSIapidatabase, "reads from and writes to", $tags="")
Rel_D(PSISystem.PSIfrontendAPI, PSISystem.PSIcommentexportAPI, "submits and gathers data stored by the backend", $tags="")

SHOW_LEGEND(true)
@enduml
